In [1]:
# Missing value treatment

In [2]:
import pandas as pd 
import numpy as np
dict={'First Score':[100,90,np.nan,95],'Second Score':[30,45,56,np.nan],'Third Score':[np.nan,40,80,98]}
dict

{'First Score': [100, 90, nan, 95],
 'Second Score': [30, 45, 56, nan],
 'Third Score': [nan, 40, 80, 98]}

In [3]:
df=pd.DataFrame(dict)
df

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [4]:
df.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [5]:
df.notnull()

   First Score  Second Score  Third Score
0         True          True        False
1         True          True         True
2        False          True         True
3         True         False         True

In [6]:
# will fill all the missing values with zero
df.fillna(0)

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

In [7]:
# fill the missing  value eith previous one 
df.fillna(method='pad')

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2         90.0          56.0         80.0
3         95.0          56.0         98.0

In [8]:
#  fill the missing value with next one
df.fillna(method='bfill')

   First Score  Second Score  Third Score
0        100.0          30.0         40.0
1         90.0          45.0         40.0
2         95.0          56.0         80.0
3         95.0           NaN         98.0

In [9]:
df

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [10]:
df.replace(to_replace=np.nan, value=-75)

   First Score  Second Score  Third Score
0        100.0          30.0        -75.0
1         90.0          45.0         40.0
2        -75.0          56.0         80.0
3         95.0         -75.0         98.0

In [13]:
a=df['First Score'].mean()
a

95.0

In [14]:
df_new=df['First Score'].fillna(value=a)

In [15]:
df_new

0    100.0
1     90.0
2     95.0
3     95.0
Name: First Score, dtype: float64

In [11]:
df.dropna(axis=0)

   First Score  Second Score  Third Score
1         90.0          45.0         40.0